[
  {
    "id": 1,
    "text": "LIVE-ADDIS Conducts Joint Review workshop with Key Stakeholders at Bellevue Hotel Addis Ababa, December 2, 2025\n\nLIVE-ADDIS successfully convened a comprehensive Joint Review workshop, gathering a wide range of key stakeholders to assess achievements so far, identifying challenges, extract lessons for future improvement and discussing strategies to further support the project participants/ beneficiaries ensure that the project remains aligned with its goals and continues to deliver meaningful impact.\n\nThe meeting brought together representatives of APHEET program participants/beneficiaries , members of the Community Action Group (CAG), Project Advisory Committee (PAC), representatives from the Addis Ababa City Administration Bureau of Finance, Women Children and Social Affairs and Labor and skill,  officials from  Yeka and LemiKura sub-cities, officials from project-implementing woredas, community representatives, CBOs, religious leaders, representatives of Selam Technical and Vocational College as well as LIVE-ADDIS Board  and APHEET program staff.\n\nThe aims of the workshop were to assess project progress, celebrate successes, identify gaps, and outline practical ways forward. Discussions also focused on ensuring sustained support for trainees after the successful completion of their vocational skills and other services provided in the year 2025, enabling them to transition effectively into employment or self-employment opportunities and generate their own income and improver wellbeing.\n\nThe workshop officially started with the welcoming remark and key note address by Dr. Sewale Abate, the member of LA Board of Director followed by presentation by Mr. Alemayehu Teshome, Founder and Executive Director of LIVE-ADDIS. \nParticipants emphasized the importance of collaboration in strengthening the project’s implementation. By sharing insights and experiences, stakeholders identified areas for improvement and reaffirmed their commitment to support the graduates in any ways that they can.\n\nThe workshop concluded with a renewed commitment from all stakeholders to continue supporting the next phases of the APHEET program in particular and LIVE-ADDIS future initiatives to support the disadvantaged and unemployed youth projects in general. Attendees underscored the value of technical and vocational education as a key driver of socio economic-empowerment, youth employment, and long-term community development.\n\n#APHEET Program #Empowering the youth is like planting seeds; nurture them today, and they will grow to bear fruit for the community tomorrow",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02SLLZ3VCvcJSCAkebdiwLsRT2XhZcmizvJWxiG7sXTDk7n5ikaTB8FjgBTziQBPb3l",
    "likes": 7,
    "comments": 1,
    "shares": 1,
    "media": [
      {
        "local_path": "/images/posts/63f9c02abd73883af69182d5334d045f.jpg",
        "ocr_text": "May be an image of one or more people and people studying",
        "type": "Photo",
        "original_id": "1440444261398557"
      },
      {
        "local_path": "/images/posts/760dd221e445e1f19d4d241bd9463534.jpg",
        "ocr_text": "May be an image of text that says 'BELLEVUE BELLEVUE BELLEVUE BELLEVUE A'",
        "type": "Photo",
        "original_id": "1440443181398665"
      },
      {
        "local_path": "/images/posts/5675e88b7a1c1623da1295a2b1585b3f.jpg",
        "ocr_text": "May be an image of lighting",
        "type": "Photo",
        "original_id": "1440443221398661"
      },
      {
        "local_path": "/images/posts/a37eefafe904c0c157ff0d95d9c9c4f6.jpg",
        "ocr_text": "May be an image of one or more people and dais",
        "type": "Photo",
        "original_id": "1440443634731953"
      },
      {
        "local_path": "/images/posts/02bcd7800f4f81cb1c9e898ba307ca69.jpg",
        "ocr_text": "May be an image of text",
        "type": "Photo",
        "original_id": "1440443238065326"
      }
    ]
  },
  {
    "id": 2,
    "text": "ጎበዝ እንዴት አደራችሁ \n\nጊዜው ትንሸ ከፍቷል ሰeለዚህ በምንም ሁኔታ ወስጥ ሆናችሁ ስትንቀሳቀሱ sውንም እንኳን ለመርዳት ቢሆን መጀመሪያ  እራሳችሁን መጠበቅ  እጅግ አስፈላጊ መሆኑን አትዘንጉ  ምክንያቱም እንዲህ ያለ ጥንቃቄ ከጎደላችሁ  አይደለም ተራው ሰው  መንገድ  ላይ ያለ ህግ አስከባሪም እንኳን ቢሆን አይረዳችሁም \n\nሌላው ግን በተለይ በተጨናነቀ ቦታ በመኪና ስትሄዱ መሶከቶቻችሁን እና በሮቻችሁን ከመቆለፍ እንዳትዘናጉ ንብረት ቀላል ነው ይተካል በሰው ላይ ጉዳት ከደረሰ ግን መመለሻው ከባድ  ስለሚሆን ጥንቃቄ እንዳይለያችሁ \n\nለማንኛውም እኔ በጣም ደህና ነኝ ይሁን እንጂ የእጅ ስልኬን ከላይ ከገለጥኳቸው መንገዶች በአንዱ  ሌቦች ስለወሰዱብኘ እና መልሼ እስከማወጣው በቀድሞ ስልኬ  በኔ ስም የሚደርሳችሁ  ማንኛውም መልእክት ካለ እንዳትቀበሉ ወይንም ምንም አይነት ጥያቄ እንዳትመልሱ ለማሳሰብ ነው ይህችን መልእክት ጫር ጫር ያደረኩት\n\nመልካም ቀን \nዓለማየሁ ተⶄመ ነኝ",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0Pga5XMSQtyjEMjyjaVY9uanBZkijc7UfbtguDjUEKbCL351cLxmFHiNxq8Dz98Xyl",
    "likes": 5,
    "comments": 6,
    "shares": 1,
    "media": []
  },
  {
    "id": 3,
    "text": "Big thanks to Koki Yekidanmeherte Legi Koki\n\nfor all of your support! Congrats for being top fans on a streak 🔥!",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02yUhSQs4gttHJzGBnRz3Du7TGqRKjzbC6piRp9nNEb2KYgT4ZjdPNDPfrcwUYaNhl",
    "likes": 0,
    "comments": 0,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/d374cee7305200ad25c791ea44a95fb7.jpg",
        "ocr_text": "May be pop art",
        "type": "Photo",
        "original_id": "1378942030882114"
      }
    ]
  },
  {
    "id": 4,
    "text": "Big thanks to Koki Yekidanmeherte Legi Koki\n\nfor all of your support! Congrats for being top fans on a streak 🔥!",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid031YUa8hpvRWfZbd7JBXr5BAXr4LJwuG1UhNfzSVjn85nMiA2vR8QxpD3fdYKjeHk9l",
    "likes": 0,
    "comments": 0,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/f52ff913ef0012107148782b7d65de51.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1378941560882161"
      }
    ]
  },
  {
    "id": 5,
    "text": "Great job, keep it up your effort to serve more with integrity !",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02yCjBJnh4TfqEvbRu6LSUx5H2fC7uPbAiHeqDg1xMkjqjVLv7nQqWWgccWNYNbBxil",
    "likes": 0,
    "comments": 0,
    "shares": 1,
    "media": []
  },
  {
    "id": 6,
    "text": "APHEET Program Hosts 3rd Steering Committee & Technical Team Joint Review Workshop\n\nFrom 31 August to 2 September 2025, the APHEET program implementing partners gathered at the Bishoftu Pyramid Hotel & Resort for the 3rd Steering Committee and Technical Team Joint Review Workshop. This event brought together consortium leaders and technical team members from across the Guassa, Adaba, and Addis pillars of the program entitled Alliance for population Health and Environment in Ethiopian (APHEET) program with the general objective of enhancing the overall wellbeing and living conditions of communities in Guassa, Adaba, and Addis Ababa by integrating Population, Health, and Environment (PHE) approaches with social and economic empowerment initiatives.\n\nThe main purpose of the meeting was to assess progress and advance strategic alignment. During the workshop, partners evaluated achievements across all three pillars, addressed critical strategic direction, and emphasized the importance of inter-pillar collaboration through cross-learning and the systematic documentation of successes, challenges, and lessons. An essential focus was also directed toward planning for the upcoming Merck Family Foundation board of trustees visit along with KKS high official in October 2025 to ensure seamless alignment with the visit’s schedule.\n\nThe workshop sessions were energized and skillfully guided by the Country Directors and Executive Directors of the six  implementing partners, with key logistical and organizational support provided by LIVE ADDIS—who serves as the alliance’s secretary and budget-holder—and PHE Ethiopia as chair for the alliance. The workshop yielded several significant outcomes: the Terms of Reference (ToR) for the Technical Team were finalized and signed, laying a clear foundation for the team’s scope and responsibilities; partners reached consensus to draft and sign a Memorandum of Understanding (MOU) committing to expanded cooperation beyond the APHEET program’s lifespan; and the Steering Committee adopted and forwarded several strategic action points aimed at enhancing engagement and coordinating implementation across all partners. \n\nThe program fully funded by Merck Family Foundation through KKS Germany",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02LdeduosMWShJoWG5rV6CGZSYumV6gHvDhL6RWA8gMwq9xWVDNfo1YDcYseZX6S5Al",
    "likes": 8,
    "comments": 1,
    "shares": 3,
    "media": [
      {
        "local_path": "/images/posts/2d5875d638f8350c2488ee1326c66b33.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1357462079696776"
      },
      {
        "local_path": "/images/posts/779c9a47b406c64c16cfcbef71a62340.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1357462073030110"
      },
      {
        "local_path": "/images/posts/88f542b20d14050a86d2061bb0dc078b.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1357462146363436"
      },
      {
        "local_path": "/images/posts/8aced06f0c6133d17ea2c0fb43b855c9.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1357462106363440"
      },
      {
        "local_path": "/images/posts/b370836e90bdd3cafc2f5498a9833e07.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1357462093030108"
      }
    ]
  },
  {
    "id": 7,
    "text": "Great Job",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0S2yTDFTpbHVn1rTzUaqmEgAgNZdP1zHoW926eLGn9xGqfxaD1e1ViRHPNcWCUzx3l",
    "likes": 4,
    "comments": 0,
    "shares": 0,
    "media": []
  },
  {
    "id": 8,
    "text": "LIVE-ADDIS organized Capacity Building and Cross-Learning Workshop for All staff members and volunteers \n\nOn July 31, 2025, LIVE-ADDIS conducted a comprehensive Capacity Building and Cross-Learning Workshop for all staff members and volunteers. The session was aimed at strengthening internal capabilities, fostering collaboration, and aligning the team around key organizational priorities. The workshop was skillfully facilitated by Prof. Wassie Kebede, Chairperson of the Board, and Mrs. Endanchiyelem Mekonnen, Vice Chair of the Board. Their leadership, facilitation and guidance created a constructive environment for open discussion, reflection, and strategic thinking.\nThe Workshop Objectives was to:\n\n Provide insights into the current dynamics, opportunities, and challenges facing LIVE-ADDIS, promoting awareness and strategic thinking.\n\n Engage board members, staff and internes in group activities focused on future program planning ensuring alignment with organizational goals.\n\n Collaboratively identify and prioritize the most critical focus areas for organizational development and action, ensuring a clear focus for the organization moving forward.\n\n Create a platform for all board members, staff and internes to express their thoughts and concerns, Identify key challenges impacting program delivery and staff performance, fostering a culture of transparency and collaboration and strengthens relationships and enhance the team spirit among staff members.\n\n Enhance the skills and capacities of staff members at LIVE-ADDIS, fostering a collaborative environment that promotes effective teamwork, strategic planning, and organizational growth.\n\nThroughout the session, participants engaged in active discussions, shared insights, and explored practical solutions to current challenges. Workshop participants were encouraged to contribute ideas freely, fostering a spirit of collaboration and mutual learning.\nOne of the core outcomes of the workshop was a collective effort, led by the Board facilitators, to identify and agree upon top organizational priorities. This process helped create a shared understanding of where the organization needs to focus its attention and resources in the coming months of 2025 and beyond.\nParticipants described the workshop as highly informative and timely. Many expressed appreciation for the opportunity to gain a deeper understanding of the organization’s strategic focus, and the role each team member plays in contributing to its mission.\nDuring the event, staff and volunteers of LIVE-ADDIS took the opportunity to surprise and congratulate Professor Wassie Kebede, on his recent appointment to full professorship at Addis Ababa University. His achievement was warmly celebrated and recognized as a significant academic milestone.\n\nThe event not only built capacity but also reinforced a sense of unity, purpose, and commitment among the staff of LIVE-ADDIS. It stands as a strong example of the organization's dedication to continuous learning, growth, and collective impact.\n\nBy Tatek, Program manager",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02aK4VzC227P6DaLqkBbK4CDXhN5m9SYtGz5Po145o6hQ9AnjDU3buWCcvTuUYpBdfl",
    "likes": 9,
    "comments": 1,
    "shares": 2,
    "media": [
      {
        "local_path": "/images/posts/b8df68852b72129888375496e101d922.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1331243472318637"
      },
      {
        "local_path": "/images/posts/979f423321fcdb2cada46b5c1b153f6b.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1331243205651997"
      },
      {
        "local_path": "/images/posts/f3d80fbfb4e75ffb7df1ffac164a2deb.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1331243095652008"
      },
      {
        "local_path": "/images/posts/0375c7fe1112d07a3ef412995742d43e.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1331244288985222"
      },
      {
        "local_path": "/images/posts/ca69a5668cd648d8feae48193f71f754.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1331243368985314"
      }
    ]
  },
  {
    "id": 9,
    "text": "Dear LIVE-ADDIS supporters, Friends and families It is with great joy that I share this news with you.\n\nAs you all know, in accordance with the decision made at the 20th regular meeting of the members of LIVE-ADDIS General assembly held on May 3, 2025 at Azemen Hotel here in Addis Ababa, the organization's structure was changed from a general assembly to a board-lead organization, and we have been working to amend our organization's bylaw and registration certificate with the approval of the Federal Charities and Associations Authority.\n\nAccordingly, with the strong support by our Board of Directors, Embers of the former general assembly and the tireless efforts and hard work of the organization’s employees, our request was approved today and we received the new certificate with the cover letter today attached with this post.\n\nSo that, on behalf of the Board of Directors, the entire staff of LIVE-ADDIS and myself, I would like to express my sincere gratitude for your tireless support in making this happen.\n\nክፍተቶችን ማጥበብ ፣ ዕድሎችን መፍጠር፣ ህይወትን መቀየር ! \nBRIDGING GAPS, CREATING OPPORTUNITES\n\n I thank you all once again",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0381WC7uE6HU4TifeZ4q8SFx1nu2GcTR7qJWAWPFqmXGHErNuV1kC54NvrAfSRCTmel",
    "likes": 5,
    "comments": 1,
    "shares": 1,
    "media": [
      {
        "local_path": "/images/posts/fd27879ab3fd091e62655dd00fd2adba.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301147321994919"
      },
      {
        "local_path": "/images/posts/41828e66b29179f06c8c7ff15d64aa65.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301147315328253"
      }
    ]
  },
  {
    "id": 10,
    "text": "",
    "url": "https://www.facebook.com/reel/1022408626399461/",
    "likes": 0,
    "comments": 0,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/9716fe5d94598c8cdab7152605379cc8.jpg",
        "ocr_text": "",
        "type": "Video",
        "original_id": "1022408626399461"
      }
    ]
  },
  {
    "id": 11,
    "text": "Local Partnership Assessment conducted by Concern World-Wide Ethiopia \n\nIn response to our partnership request, a team from Concern Worldwide Ethiopia Country Office conducted a comprehensive local partner assessment tool CLIPAT at LIVE-ADDIS (LA) on June 24th, and July 1st, 2025. The assessment aimed to evaluate LA's organizational capacity and readiness for strategic partner to Concern World-wide Ethiopia Urban development programs and or projects.\n\nDuring the assessment, the Concern Worldwide team undertook a thorough review process, which included examining key organizational documents, attending a presentation on LA’s institutional profile, conducting interviews with the founder and Executive Director and heads of departments, and facilitating group discussions with relevant staff members. This multifaceted approach, we believe, provided a holistic understanding of LA’s operational capabilities, strategic priorities, and governance structures.\n\nThe outcome of this assessment will serve as an important input in Concern Worldwide decision-making process regarding potential strategic partnerships. It also marks a significant milestone in LA’s broader efforts to establish meaningful and sustainable collaborations with reputable development organizations.\n\nLIVE-ADDIS remains committed to continuing and strengthening this potential partnership with Concern Worldwide, with the shared goal of achieving lasting development impact and addressing the needs of the communities we serve.\n\nBy Tatek Dejenie, program manager",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02RQw8rP98ds79UUEP7K52j2gD7d95KQurF94ApQUtoibLvK2X7jpFJQUj6HQdb3aUl",
    "likes": 4,
    "comments": 2,
    "shares": 1,
    "media": [
      {
        "local_path": "/images/posts/f7b43aeefdd614df3bbe128e6d8e4f5b.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301125735330411"
      },
      {
        "local_path": "/images/posts/c8ff9036cea62e5db0e45319029f095e.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301125805330404"
      },
      {
        "local_path": "/images/posts/4442c2a74e59974ca8fe9f614339fe00.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301125841997067"
      },
      {
        "local_path": "/images/posts/0000dbc996656c83efda29b20231b379.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301126481997003"
      },
      {
        "local_path": "/images/posts/5633c033a07fe5ee04f06c0c34d45305.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301127035330281"
      }
    ]
  },
  {
    "id": 12,
    "text": "Great Job and finger crossed !",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0CWdMLvbYt3iBvCGp3h4yK1Ja1VpSuQucCBB515sNJfTHuGvkgw8kD1GXjrqK919rl",
    "likes": 0,
    "comments": 0,
    "shares": 0,
    "media": []
  },
  {
    "id": 13,
    "text": "Local Partnership Assessment conducted by Concern World-Wide Ethiopia \n\nIn response to our partnership request, a team from Concern Worldwide Ethiopia Country Office conducted a comprehensive local partner assessment tool CLIPAT at LIVE-ADDIS (LA) on June 24th, and July 1st, 2025. The assessment aimed to evaluate LA's organizational capacity and readiness for strategic partner to Concern World-wide Ethiopia Urban development programs and or projects.\n\nDuring the assessment, the Concern Worldwide team undertook a thorough review process, which included examining key organizational documents, attending a presentation on LA’s institutional profile, conducting interviews with the founder and Executive Director and heads of departments, and facilitating group discussions with relevant staff members. This multifaceted approach, we believe, provided a holistic understanding of LA’s operational capabilities, strategic priorities, and governance structures.\n\nThe outcome of this assessment will serve as an important input in Concern Worldwide decision-making process regarding potential strategic partnerships. It also marks a significant milestone in LA’s broader efforts to establish meaningful and sustainable collaborations with reputable development organizations.\n\nLIVE-ADDIS remains committed to continuing and strengthening this potential partnership with Concern Worldwide, with the shared goal of achieving lasting development impact and addressing the needs of the communities we serve.\n\nBy Tatek Dejenie, program manager",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0RS2Y9db3MTfeq8C3a2saEKxk83k3y3N4t62SgkqjyKT91skdJB2cTDsqwD1CquW2l",
    "likes": 0,
    "comments": 0,
    "shares": 1,
    "media": [
      {
        "local_path": "/images/posts/f74a662293aad853da01d3774ed7c588.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301104428665875"
      },
      {
        "local_path": "/images/posts/621af77bb280665c9d92783fa72f838b.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301104541999197"
      },
      {
        "local_path": "/images/posts/3c149f55ff7cee75e1211a6487d09d30.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301104558665862"
      },
      {
        "local_path": "/images/posts/0613e61aad195a5d41521596b1e52ffb.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301107415332243"
      },
      {
        "local_path": "/images/posts/b85fc329da3fa45d73ec7c43aa9c0d9b.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1301107355332249"
      }
    ]
  },
  {
    "id": 15,
    "text": "ለመረጃ ያህል !",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02XMVVboL5eJxphh5rHgmZia72TFaW3vdCQ6dxKRf8pWw6KLjFuKQj5t4nqsHvWzp7l",
    "likes": 1,
    "comments": 0,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/4694450e2053cbcb6063b5915372a79b.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1291497266293258"
      }
    ]
  },
  {
    "id": 16,
    "text": "As part of the four-year initiative launched in January 2025, LA hosted a Pre-Service Orientation Yesterday June 19, 2025, at Selam Technical and Vocational Collage under Selam Children’s Village (SELAM-CV). The session designed to furnish prospective trainees with vital information marks the kickoff for the vocational skills development program under the project entitled Equipping unemployed young people to enter in to the Labor Market through Skills Development, Entrepreneurship and SRH Awareness in selected Woreda of Yeka and LemiKura Sub-Cities of Addis Ababa City Administration fully funded by Merck Family Foundation through Karl Kübel Stiftung für Kind und Familie, Germany \nMr. Alemayehu Teshome, founder and Executive Director of LIVE ADDIS, extended a warm welcome to the participants, who included the trainees, as well as officials from Yeka and LemiKura sub cities and Yeka Sub-City Woreda 09 and LemiKura Sub-City Woreda 10 where the project is implementing.\n\nSELAM CV’s Technical & Vocational College, renowned for its hands-on training and strong industry connections, was represented at the event by its dean of the collage and trainers from various departments. They provided an overview of each department; their market prospects, potential for self employment versus wage employment to help trainees choose the field best aligned with their interests and career goals.\n\nThroughout 2025, LA aims to deliver market-driven vocational training to 46 unemployed, vulnerable youths drawn from the targeted areas. Representatives from both sub cities and Woreda administrations highlighted how such training initiatives play a transformative role in shaping youths’ futures and empowering them to secure sustainable livelihoods.\n\nBy T.D, program Manager",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0kpEdJfBx9es4QwzesQ4PgXGyD79FjfeY3VdfA7ebau96JUGShGPof2TFMKnQCC6fl",
    "likes": 3,
    "comments": 2,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/435c9d07c3da6190cbddda81f19425b3.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1291375046305480"
      },
      {
        "local_path": "/images/posts/862f242e5388e9f693d6d9d3de0f39b9.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1291375032972148"
      },
      {
        "local_path": "/images/posts/1a58ae4e92b958330c5723aafb97419a.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1291374929638825"
      },
      {
        "local_path": "/images/posts/413832ff0fba2eb31f588b1483245b64.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1291374949638823"
      },
      {
        "local_path": "/images/posts/563bc623c27985a07a5ecedbf54e81ab.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1291375742972077"
      }
    ]
  },
  {
    "id": 17,
    "text": "Updates\n\nLIVE-ADDIS Holds 20th General Assembly and Transitions to Board-Led Governance\n\nOn Saturday, May 3, 2025, LIVE-ADDIS held its 20th  Annual General Assembly at Azzeman Hotel, Addis Ababa, bringing together founders , members of the general assembly, the outgoing board directors , invited guests from Federal Democratic Republic of Civil Society organizations Authority , key stakeholders and  staff of the organization to review organizational performance and discuss future directions and organizational structure and bi-law.\n\nMr. Alemayehu presented the 2024 physical and financial performance report, Mr. Tatek the program manager presented organizational plan for the year 2025 and opportunities followed by an external audit report. The presentations outlined key achievements and challenges, prompting in-depth discussions about the organization's long-term sustainability.\n\nA central topic was the viability of the existing General Assembly-led governance model. Mr. Alemayehu proposed a transition to a Board-led structure Mr. Alemayehu also mentioned that the new Charity Organizations Proclamation No. 1113/2011 allows civil society organizations to operate as either a general assembly or a board-led organization.\n\nBy doing so, the organization will  increase its operational efficiency and Effectiveness,  save costs as much as possible, enhance organizational transparency and accountability in the governance process,  expand the services provided by the organization and increase accessibility by obtaining more specialized and professional support. \n\nAfter thorough deliberation, members agreed to adopt the Board-led model, marking a major organizational shift aimed at enhancing efficiency and adaptability.\n\nAs part of the assembly, seven new board members were elected to lead the organization forward. Members also took the opportunity to acknowledge and thank the outgoing board for their service and contributions፣ to expand the services provided by the organization and increase accessibility by obtaining more specialized and professional support,\n\nFollowing their official election during the 20th Annual General Assembly, the newly appointed board members of LIVE-ADDIS held their first internal meeting today, May 15, 2025, to assign leadership roles within the board. The meeting focused on establishing a leadership structure that reflects both the strategic direction of the organization and the diverse expertise of its board members. \n\nThe board engaged in a collaborative, merit-based selection process, thoroughly evaluating each member’s professional experience and academic qualifications. Following this deliberation, Dr. Wassie Kebede was unanimously elected as Chairperson of the Board, and W/ro Endanchiyelem Mekonnen was appointed as Deputy Chairperson.\n\nThis transition reflects LIVE-ADDIS’s ongoing commitment to strong governance, transparency, and effective leadership as it advances its mission in a more sustainable and strategic manner.\n\nStay tuned",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02oH5hym86sDXVtfX4jGSrv8AF3Mo7usXGfVf3tBhBMQxWiBaXLchfnvgeez9m67fkl",
    "likes": 9,
    "comments": 2,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/a51156a4c37264500ece190066985b12.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1262406819202303"
      },
      {
        "local_path": "/images/posts/ac1395542db5ae4570569df595f9672c.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1262406865868965"
      },
      {
        "local_path": "/images/posts/b5b55216269dc782a525c8d6d3284add.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1262406789202306"
      },
      {
        "local_path": "/images/posts/a825b9c51c1501e5ad5c247e92f5d889.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1262406775868974"
      },
      {
        "local_path": "/images/posts/dd8f8dc17b3dcb902a197437a412c245.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1262407295868922"
      }
    ]
  },
  {
    "id": 19,
    "text": "LIVE-ADDIS officially launches a four years project to Empower Youth in Addis Ababa\n\nOn March 28, 2025, LIVE-ADDIS proudly hosted an official project launching workshop entitled “Equipping Unemployed Young People to Enter into the Labor Market through Skills Development, Entrepreneurship, and SRH\" knowledge and Awareness as part of ALLIANCE FOR PHE IN ETHIOPIA (APHEET) PROGRAM funded by the Merck Family Foundation through Karl Kübel Stiftung für Kind und Familie (KKF),\n\nThe APHEET program operates across three strategic implementation areas in Ethiopia, referred to as the program’s “pillars”: Guassa, Adaba, and Addis Ababa/Bishoftu. These regions present distinct challenges opportunities that the program addresses through an integrated Population, Health, and Environment (PHE) approach, tailored to each context while fostering cross-learning and sustainability.\n\nThe workshop gathered key stakeholders, including representatives from the Addis Ababa City Administration Bureau (signatories of the project), government officials, government stakeholders from Yeka and Lemi-Kura sub-cities, Donors, APHEET, and other development partners, potential project beneficiaries, community members, and LIVE-ADDIS board of directors and staff of the project . The event commenced at 2:30 PM and spanned half a day, featuring a comprehensive overview of LIVE-ADDIS, insights into the previous KKS project, and a detailed presentation on the APHEET project. This presentation covered: target areas and direct beneficiaries, project duration and budget, general and specific objectives, key innovations and stakeholders and risk management strategies.\n\nA significant aspect of the workshop was the establishment of a Project Advisory Committee, formed from participants to guide the initiatives and ensure alignment with community needs.\n\nThe session fostered constructive dialogue, allowing attendees to reflect on the project’s objectives and anticipated impact. The APHEET project initiative aims to enhance employment opportunities for youth while promoting hands on vocational skills and entrepreneurship trainings and improving sexual and reproductive health awareness. With strong collaboration among key stakeholders, the APHEET project is set to make a significant difference in the lives of many young people in Addis Ababa. \nStay tuned for further updates on this impactful initiative from LIVE-ADDIS and the APHEET network.\n\n#APHEET #Youth Empowerment #LIVEADDIS #Skills Development #Entrepreneurship #SRH\n\nBy Melat Daniel, Community facilitator",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid02rtYgCUhqUmLYD7rH8DqTmUqkSeGZ1BRDk4o15rNVmXmaGE1daX9QsJTCPUapEpJgl",
    "likes": 24,
    "comments": 8,
    "shares": 1,
    "media": [
      {
        "local_path": "/images/posts/7d8e3b5b98de8326c20477e117870b5c.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1222390769870575"
      },
      {
        "local_path": "/images/posts/d8f16db814e58097af77e8c6d83b2e90.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1222390733203912"
      },
      {
        "local_path": "/images/posts/8ec232a633805eabdc52ad060aa7e1b4.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1222390813203904"
      },
      {
        "local_path": "/images/posts/9aaf5b339f47c055db1c7ffc7bf64f5c.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1222391273203858"
      },
      {
        "local_path": "/images/posts/61e2a1eb27ee8da82dcba24db332510c.jpg",
        "ocr_text": "No photo description available.",
        "type": "Photo",
        "original_id": "1222391293203856"
      }
    ]
  },
  {
    "id": 20,
    "text": "https://t.me/ccrda_et/665",
    "url": "https://www.facebook.com/www.liveaddis.org/posts/pfbid0gFjFb2ruUhEyxaoNxuCTMYzUFrSnBrgyvESL7Ho7StqYJDSrntLUy5utJarMQWrsl",
    "likes": 0,
    "comments": 0,
    "shares": 0,
    "media": [
      {
        "local_path": "/images/posts/6e00670e7dc9c06c92baa393257ff06a.jpg",
        "ocr_text": "",
        "type": "GenericAttachmentMedia",
        "original_id": "1192759189500400"
      }
    ]
  }
]